     d FiltersUP       pr                  extpgm('FILTERSUP')
     d  rtnCode                       3i 0
     d  lStat                          *   const
     d  filters                        *   const
