     d jrnentdp        pr                  extpgm('JRNENTDP')
     d  rtnCode                       3i 0
     d  option                        1a   const
     d  ztl                         131    const varying
     d  lVariant                       *   const
     d  hDta                         10i 0 const
     d  lYViews                        *
     d  lFmts                          *
     d  lForms                         *
     d  lStats                         *
