      // get Welcome Message
       dcl-pr env_getWelcomeMessage varchar(100);
       end-pr;
      // get appli path
       dcl-pr env_getAppliPath varchar(50);
       end-pr;
      // get client path
       dcl-pr env_getClientPath varchar(50);
       end-pr;
